Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://kadiyalashowkathali.github.io/LogiRouteApp"
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 100
      name: "Baseline 100 VUs Ramp and Sustain Phase"
  defaults:
    headers:
      User-Agent: "Artillery-LoadTest-Agent"
scenarios:
  - name: "LogiRoute Platform Browsing & Booking Scenario"
    flow:
      - get:
          url: "/"
      - get:
          url: "/index.html"
